jlu005807/Smart_Home/demo/Project/GD32F450Z_BSP/src/i2c.c
            /* decrement the read bytes counter */
            number_of_byte--;
        } 
    }
    
    /* wait until the stop condition is finished */
    while(I2C_CTL0(i2c_periph)&0x0200);
    
    /* enable acknowledge */
    i2c_ack_config(i2c_periph,I2C_ACK_ENABLE);

    i2c_ackpos_config(i2c_periph,I2C_ACKPOS_CURRENT);

}
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*!
    \brief      read data from the slave
    \param[in]  p_buffer: pointer to the buffer that receives the data read from the slave
    \param[in]  read_address: slave internal address to start reading from
    \param[in]  number_of_byte: number of bytes to reads from the slave
    \param[out] none
    \retval     none
*/
uint8_t i2c_read(uint32_t i2c_periph,uint8_t i2c_addr,uint8_t read_address,uint8_t* p_buffer,  uint16_t number_of_byte)
{  
		uint8_t	rt = 1;
		uint16_t i;
	  
	  /* wait until I2C bus is idle */
    while(i2c_flag_get(i2c_periph, I2C_FLAG_I2CBSY));

    if(2 == number_of_byte){
        i2c_ackpos_config(i2c_periph,I2C_ACKPOS_NEXT);
    }
    
    /* send a start condition to I2C bus */
    i2c_start_on_bus(i2c_periph);
     
		/* wait until SBSEND bit is set */
    while(!i2c_flag_get(i2c_periph, I2C_FLAG_SBSEND));
    
    /* send slave address to I2C bus */
    i2c_master_addressing(i2c_periph, i2c_addr, I2C_TRANSMITTER);
    
    /* wait until ADDSEND bit is set */
    while(!i2c_flag_get(i2c_periph, I2C_FLAG_ADDSEND))
		{
			i++ ;
			if(i > 60000)
			{
				/* send a stop condition to I2C bus */
				i2c_stop_on_bus(i2c_periph);
				rt = 0;
				return rt;
			}
		}   
    
    /* clear the ADDSEND bit */
    i2c_flag_clear(i2c_periph,I2C_FLAG_ADDSEND);
    
    /* wait until the transmit data buffer is empty */
    while(SET != i2c_flag_get( i2c_periph , I2C_FLAG_TBE ));

    /* enable i2c_periph*/
    i2c_enable(i2c_periph);
    
    /* send the slave internal address to write to */
    i2c_data_transmit(i2c_periph, read_address);  
    
    /* wait until BTC bit is set */
    while(!i2c_flag_get(i2c_periph, I2C_FLAG_BTC));
    
    /* send a start condition to I2C bus */
    i2c_start_on_bus(i2c_periph);
    
    /* wait until SBSEND bit is set */
    while(!i2c_flag_get(i2c_periph, I2C_FLAG_SBSEND));
    
    /* send slave address to I2C bus */
    i2c_master_addressing(i2c_periph, i2c_addr, I2C_RECEIVER);

    if(number_of_byte < 3){
        /* disable acknowledge */
        i2c_ack_config(i2c_periph,I2C_ACK_DISABLE);
    }
    
    /* wait until ADDSEND bit is set */
    while(!i2c_flag_get(i2c_periph, I2C_FLAG_ADDSEND));
    
    /* clear the ADDSEND bit */
    i2c_flag_clear(i2c_periph,I2C_FLAG_ADDSEND);
    
    if(1 == number_of_byte){
        /* send a stop condition to I2C bus */
        i2c_stop_on_bus(i2c_periph);
    }
    
    /* while there is data to be read */
    while(number_of_byte){
        if(3 == number_of_byte){
            /* wait until BTC bit is set */
            while(!i2c_flag_get(i2c_periph, I2C_FLAG_BTC));

            /* disable acknowledge */
            i2c_ack_config(i2c_periph,I2C_ACK_DISABLE);
        }
        if(2 == number_of_byte){
            /* wait until BTC bit is set */
            while(!i2c_flag_get(i2c_periph, I2C_FLAG_BTC));
            
            /* send a stop condition to I2C bus */
            i2c_stop_on_bus(i2c_periph);
        }
        
        /* wait until the RBNE bit is set and clear it */
        if(i2c_flag_get(i2c_periph, I2C_FLAG_RBNE)){
            /* read a byte from the EEPROM */
            *p_buffer = i2c_data_receive(i2c_periph);
            
            /* point to the next location where the byte read will be saved */
            p_buffer++; 
            
            /* decrement the read bytes counter */
            number_of_byte--;
        } 
    }
    
    /* wait until the stop condition is finished */
    while(I2C_CTL0(i2c_periph)&0x0200);
    
    /* enable acknowledge */
    i2c_ack_config(i2c_periph,I2C_ACK_ENABLE);
    
		i2c_ackpos_config(i2c_periph,I2C_ACKPOS_CURRENT);
		
		return rt;
}

/*********************************************************************************************************
函数名:     init_i2c
入口参数:   初始化i2c(0和1)
出口参数:   无 
作者:       zzz
日期:       2023/3/28
调用描述:   使用I2C器件前调用此函数来初始化i2c
***********************************************************************************************************/
void init_i2c(void)
{
     /* configure I2C GPIO */
    i2c0_gpio_config();
	  /* configure I2C */
    i2c0_config(); 			
		
	  /* configure I2C GPIO */
    i2c1_gpio_config();
	  /* configure I2C */
    i2c1_config(); 	
}


/*********************************************************************************************************
函数名:     get_board_address
入口参数:   address 初始地址
出口参数:   无 
返回值:     eborad_address实际得到的结构体地址
作者:       zzz
日期:       2023/3/31
调用描述:   得到实际的I2C地址和I2C口
**********************************************************************************************************/
i2c_addr_def get_board_address(uint8_t address)
{
     i2c_addr_def eboard_addess;

	   eboard_addess.flag = 0;
	
	   if(i2c_delay_addr_poll(I2C0,address))
		 {
			    eboard_addess.periph = I2C0;
				  eboard_addess.addr = address;
					eboard_addess.flag = 1;			
		 } 			 
	   if(eboard_addess.flag != 1)
		 {
			    if(i2c_delay_addr_poll(I2C1,address))
					{
						  eboard_addess.periph = I2C1;
				      eboard_addess.addr = address;
					    eboard_addess.flag = 1; 
          }						
     }	
     
		 return eboard_addess;		 
}







//////////////////////////////////////////////////////////////////////////////////////////////////////
void i2c_delay_byte_write(uint32_t i2c_periph,uint8_t i2c_addr,uint8_t write_address,uint8_t buffer)
{
		uint16_t i;
	  uint32_t time = 50000;
	
    /* wait until I2C bus is idle */
    while(i2c_flag_get(i2c_periph, I2C_FLAG_I2CBSY));
    i2c_delay(time);
	
    /* send a start condition to I2C bus */
    i2c_start_on_bus(i2c_periph);
    i2c_delay(time);
	
    /* wait until SBSEND bit is set */
    while(!i2c_flag_get(i2c_periph, I2C_FLAG_SBSEND));
    i2c_delay(time);
	
    /* send slave address to I2C bus */
    i2c_master_addressing(i2c_periph, i2c_addr, I2C_TRANSMITTER);
    i2c_delay(time);
	
    /* wait until ADDSEND bit is set */
    while(!i2c_flag_get(i2c_periph, I2C_FLAG_ADDSEND))
		{
			i++ ;
			if(i > 60000)
			{
				/* send a stop condition to I2C bus */
				i2c_stop_on_bus(i2c_periph);
				return;
			}
		}   
    i2c_delay(time);
		
    /* clear the ADDSEND bit */
    i2c_flag_clear(i2c_periph,I2C_FLAG_ADDSEND);
    i2c_delay(time);
		
