jlu005807/Smart_Home/demo/Project/GD32F450Z_BSP/src/i2c.c
            /* decrement the read bytes counter */
            number_of_byte--;
        } 
    }
    
		/* wait until the stop condition is finished */
    while(I2C_CTL0(i2c_periph)&0x0200);
    
    /* enable acknowledge */
    i2c_ack_config(i2c_periph,I2C_ACK_ENABLE);
    //i2c_delay(time);
		
		i2c_ackpos_config(i2c_periph,I2C_ACKPOS_CURRENT);
		//i2c_delay(time);
		
		
		return rt;
}





/*!
    \brief      i2c slave addr poll
    \param[in]  i2c_periph：I2C0 or I2C1
		\param[in]  poll_addr：poll address
    \param[out] result: poll result
    \retval     none
*/
uint8_t i2c_delay_addr_poll(uint32_t i2c_periph,uint8_t poll_addr)
{
		uint16_t i = 0;
		uint8_t result;
	  uint32_t time = 20000;
	
    /* wait until I2C bus is idle */
    while(i2c_flag_get(i2c_periph, I2C_FLAG_I2CBSY));
    i2c_delay(time);
	
    /* send a start condition to I2C bus */
    i2c_start_on_bus(i2c_periph);
    i2c_delay(time);   
	
    /* wait until SBSEND bit is set */
    while(!i2c_flag_get(i2c_periph, I2C_FLAG_SBSEND));
    i2c_delay(time);   
	
	
    /* send slave address to I2C bus */
		i2c_master_addressing(i2c_periph, poll_addr, I2C_TRANSMITTER);
	  i2c_delay(time);
	
    /* wait until ADDSEND bit is set */
    while(!i2c_flag_get(i2c_periph, I2C_FLAG_ADDSEND))
		{
			i++ ;
			if(i > 60000)
			{
				break;
			}
		}
    
		if(i > 60000)
		{
			result = 0;
		}
		else
		{
			result = 1;
		}		

    /* send a stop condition to I2C bus */
    i2c_stop_on_bus(i2c_periph);
    i2c_delay(time);
		
    /* wait until the stop condition is finished */
    while(I2C_CTL0(i2c_periph)&0x0200);
		i2c_delay(time);
		
		return result;
}










